In [28]:
import pandas as pd
from sklearn.model_selection import cross_val_score
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import LabelEncoder
from sklearn.impute import SimpleImputer

In [29]:
titanic_data = pd.read_csv('./titanic-2.csv')
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
age_imputer = SimpleImputer(strategy='mean')
titanic_data['Age'] = age_imputer.fit_transform(titanic_data[['Age']])

In [31]:
Label_encoder = LabelEncoder()
titanic_data['Sex'] = Label_encoder.fit_transform(titanic_data['Sex'])
titanic_data['Embarked'] = Label_encoder.fit_transform(titanic_data['Embarked'])

In [32]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [33]:
embarked_imputer = SimpleImputer(strategy='most_frequent')
titanic_data['Embarked'] = age_imputer.fit_transform(titanic_data[['Embarked']])

In [34]:
titanic_data = titanic_data.drop(['Name','Ticket','Cabin'],axis=1)

In [35]:
X = titanic_data.drop('Survived', axis=1)
y = titanic_data['Survived']

In [36]:
clf = DecisionTreeClassifier(random_state=42)

In [39]:
k = 5
cv_scores = cross_val_score(clf,X,y,cv=k)
cv_scores

array([0.61452514, 0.7752809 , 0.82022472, 0.75842697, 0.83707865])

In [40]:
cv_scores.mean()

np.float64(0.7611072751239721)